Revit 2024 API
StructuralAsset.MetalThermallyTreated Property
 Flag indicating whether the asset describes a material that is thermally treated or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public bool MetalThermallyTreated { get; set; }
Visual Basic
Public Property MetalThermallyTreated As Boolean
	Get
	Set
Visual C++
public:
property bool MetalThermallyTreated {
	bool get ();
	void set (bool value);
}
Remarks
 Applies to Metal-based structural assets.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InapplicableDataException |  When setting this property: the material type must be Metal to set this property.
See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace